; domain
(define (domain coffee-robot)
   (:requirements :typing)
   (:types room door robot)
   (:predicates	
		(adj ?r1 ?r2 - room)
		(connects ?d - door ?r1 ?r2 - room)
		(isOpen ?d - door)
		(isClosed ?d - door)
		(coffeeInRoom ?r - room)
		(holdCoffee ?r - robot)
		(emptyHand ?rob - robot)
		(at ?rob - robot ?r - room)
		)		

;; Notice how the opening a door that connects two rooms 
;; adds the adjacency predicats in the effect	
(:action open
	:parameters (?d - door ?r1 ?r2 - room ?rob - robot)
	:precondition (and (isClosed ?d) (connects ?d ?r1 ?r2) (at ?rob ?r1) (emptyHand ?rob))
	:effect (and (isOpen ?d) (adj ?r1 ?r2) (adj ?r2 ?r1)  (not (isClosed ?d))) 
)

(:action close
	:parameters (?d - door ?r1 ?r2 - room ?rob - robot)
	:precondition (and (adj ?r1 ?r2) (isOpen ?d)(emptyHand ?rob)(at ?rob ?r1)); (connects ?d ?r1 ?r2) (at ?rob ?r1) (emptyHand ?rob))
	:effect (and (isClosed ?d) (not (isOpen ?d)))
)
(:action move
	:parameters (?r1 ?r2 - room ?rob - robot); ?d - door)
	:precondition (and (at ?rob ?r1)(adj ?r1 ?r2) );(and (isOpen ?d) (at ?rob ?r1) (connects ?d ?r1 ?r2) (adj ?r1 ?r2))
	:effect (and (at ?rob ?r2) (not (at ?rob ?r1))); (adj ?r2 ?r1))
)

(:action grabCoffe
	:parameters (?r - room ?rob - robot)
	:precondition (and (coffeeInRoom ?r) (emptyHand ?rob) (at ?rob ?r) )
	:effect (and (holdCoffee ?rob) (at ?rob ?r)(not(coffeeInRoom ?r)) 
	(not(emptyHand ?rob)))
)

(:action dropOffCoffee;needs to open door. 
	:parameters (?r - room ?rob - robot); ?d - door)
	:precondition (and (holdCoffee ?rob) (at ?rob ?r))
	:effect (and (emptyHand ?rob) (coffeeInRoom ?r)(not(holdCoffee ?rob))(at ?rob ?r))
)


)

; problem
(define 
   (problem fetch-coffee)
   (:domain coffee-robot)
   (:objects robotRoom livingRoom kitchen bedroom hall - room
	     d1 d2 d3 d4 - door
	     rob - robot
         
  )	

   (:init 

    (at rob robotRoom)
    (emptyHand rob)
    (coffeeInRoom kitchen)
	(connects d1 robotRoom hall)
	(connects d1 hall robotRoom)
	(isClosed d1)
    (connects d3 hall bedroom)
    (connects d3 bedroom hall)
    (isClosed d3)
    (connects d2 hall livingRoom)
    (connects d2 livingRoom hall)
    (isClosed d2)
    (connects d4 livingRoom kitchen)
    (connects d4 kitchen livingRoom)
    (isClosed d4)
    
    
   ;; Rest of inital condition  
   ;;

   ) 
(:goal 
       (and 
       (at rob robotRoom)
       (coffeeInRoom bedroom)
       (emptyHand rob)
       (isClosed d1)
       (isClosed d2)
       (isClosed d3)
       (isClosed d4)
       ;; The goal state goes here
       )

)
)

; plan
1. (open d1 robotroom hall rob)
   deleted: (isclosed d1)
   added: (isopen d1) (adj robotroom hall) (adj hall robotroom)
   goals met: 5 of 7
2. (move robotroom hall rob)
   deleted: (at rob robotroom)
   added: (at rob hall)
   goals met: 4 of 7
3. (open d3 hall bedroom rob)
   deleted: (isclosed d3)
   added: (isopen d3) (adj hall bedroom) (adj bedroom hall)
   goals met: 3 of 7
4. (open d2 hall livingroom rob)
   deleted: (isclosed d2)
   added: (isopen d2) (adj hall livingroom) (adj livingroom hall)
   goals met: 2 of 7
5. (move hall livingroom rob)
   deleted: (at rob hall)
   added: (at rob livingroom)
   goals met: 2 of 7
6. (open d4 livingroom kitchen rob)
   deleted: (isclosed d4)
   added: (isopen d4) (adj livingroom kitchen) (adj kitchen livingroom)
   goals met: 1 of 7
7. (move livingroom kitchen rob)
   deleted: (at rob livingroom)
   added: (at rob kitchen)
   goals met: 1 of 7
8. (grabcoffe kitchen rob)
   deleted: (coffeeinroom kitchen) (emptyhand rob)
   added: (holdcoffee rob)
   goals met: 0 of 7
9. (move kitchen livingroom rob)
   deleted: (at rob kitchen)
   added: (at rob livingroom)
   goals met: 0 of 7
10. (move livingroom hall rob)
   deleted: (at rob livingroom)
   added: (at rob hall)
   goals met: 0 of 7
11. (move hall bedroom rob)
   deleted: (at rob hall)
   added: (at rob bedroom)
   goals met: 0 of 7
12. (dropoffcoffee bedroom rob)
   deleted: (holdcoffee rob)
   added: (emptyhand rob) (coffeeinroom bedroom)
   goals met: 2 of 7
13. (move bedroom hall rob)
   deleted: (at rob bedroom)
   added: (at rob hall)
   goals met: 2 of 7
14. (close d3 hall bedroom rob)
   deleted: (isopen d3)
   added: (isclosed d3)
   goals met: 3 of 7
15. (move hall livingroom rob)
   deleted: (at rob hall)
   added: (at rob livingroom)
   goals met: 3 of 7
16. (close d4 livingroom kitchen rob)
   deleted: (isopen d4)
   added: (isclosed d4)
   goals met: 4 of 7
17. (move livingroom hall rob)
   deleted: (at rob livingroom)
   added: (at rob hall)
   goals met: 4 of 7
18. (close d2 hall livingroom rob)
   deleted: (isopen d2)
   added: (isclosed d2)
   goals met: 5 of 7
19. (move hall robotroom rob)
   deleted: (at rob hall)
   added: (at rob robotroom)
   goals met: 6 of 7
20. (close d1 robotroom hall rob)
   deleted: (isopen d1)
   added: (isclosed d1)
   goals met: 7 of 7
